



MPLS Working Group                                             G. Mirsky
Internet-Draft                                                  Ericsson
Intended status: Standards Track                             J. Tantsura
Expires: 18 August 2022                                 Juniper Networks
                                                           I. Varlashkin
                                                                  Google
                                                                 M. Chen
                                                                  Huawei
                                                        14 February 2022


 Bidirectional Forwarding Detection (BFD) Directed Return Path for MPLS
                      Label Switched Paths (LSPs)
                    draft-ietf-mpls-bfd-directed-19

Abstract

   Bidirectional Forwarding Detection (BFD) is expected to be able to
   monitor a wide variety of encapsulations of paths between systems.
   When a BFD session monitors an explicitly routed unidirectional path
   there may be a need to direct egress BFD peer to use a specific path
   for the reverse direction of the BFD session.

Status of This Memo

   This Internet-Draft is submitted in full conformance with the
   provisions of BCP 78 and BCP 79.

   Internet-Drafts are working documents of the Internet Engineering
   Task Force (IETF).  Note that other groups may also distribute
   working documents as Internet-Drafts.  The list of current Internet-
   Drafts is at https://datatracker.ietf.org/drafts/current/.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as "work in progress."

   This Internet-Draft will expire on 18 August 2022.

Copyright Notice

   Copyright (c) 2022 IETF Trust and the persons identified as the
   document authors.  All rights reserved.

   This document is subject to BCP 78 and the IETF Trust's Legal
   Provisions Relating to IETF Documents (https://trustee.ietf.org/
   license-info) in effect on the date of publication of this document.



Mirsky, et al.           Expires 18 August 2022                 [Page 1]

Internet-Draft   BFD Directed Return Path for MPLS LSPs    February 2022


   Please review these documents carefully, as they describe your rights
   and restrictions with respect to this document.  Code Components
   extracted from this document must include Revised BSD License text as
   described in Section 4.e of the Trust Legal Provisions and are
   provided without warranty as described in the Revised BSD License.

Table of Contents

   1.  Introduction  . . . . . . . . . . . . . . . . . . . . . . . .   2
     1.1.  Conventions used in this document . . . . . . . . . . . .   3
       1.1.1.  Requirements Language . . . . . . . . . . . . . . . .   3
   2.  Problem Statement . . . . . . . . . . . . . . . . . . . . . .   3
   3.  Control of the Reverse BFD Path . . . . . . . . . . . . . . .   3
     3.1.  BFD Reverse Path TLV  . . . . . . . . . . . . . . . . . .   3
     3.2.  Return Codes  . . . . . . . . . . . . . . . . . . . . . .   5
   4.  Use Case Scenario . . . . . . . . . . . . . . . . . . . . . .   5
   5.  Operational Considerations  . . . . . . . . . . . . . . . . .   6
   6.  IANA Considerations . . . . . . . . . . . . . . . . . . . . .   6
     6.1.  BFD Reverse Path TLV  . . . . . . . . . . . . . . . . . .   6
     6.2.  Return Code . . . . . . . . . . . . . . . . . . . . . . .   7
   7.  Implementation Status . . . . . . . . . . . . . . . . . . . .   7
   8.  Security Considerations . . . . . . . . . . . . . . . . . . .   8
   9.  Normative References  . . . . . . . . . . . . . . . . . . . .   8
   Appendix A.  Acknowledgments  . . . . . . . . . . . . . . . . . .   9
   Authors' Addresses  . . . . . . . . . . . . . . . . . . . . . . .   9

1.  Introduction

   [RFC5880], [RFC5881], and [RFC5883] established the BFD protocol for
   IP networks.  [RFC5884] and [RFC7726] set rules for using BFD
   asynchronous mode over IP/MPLS LSPs, while not defining means to
   control the path an egress BFD system uses to send BFD control
   packets towards the ingress BFD system.

   For the case when BFD is used to detect defects of the traffic
   engineered LSP the path the BFD control packets transmitted by the
   egress BFD system toward the ingress may be disjoint from the LSP in
   the forward direction.  The fact that BFD control packets are not
   guaranteed to follow the same links and nodes in both forward and
   reverse directions may be one of the factors contributing to
   producing false positive defect notifications, i.e., false alarms, at
   the ingress BFD peer.  Ensuring that both directions of the BFD
   session use co-routed paths may, in some environments, improve the
   determinism of the failure detection and localization.

   This document defines the BFD Reverse Path TLV as an extension to LSP
   Ping [RFC8029] and proposes that it is to be used to instruct the
   egress BFD system to use an explicit path for its BFD control packets



Mirsky, et al.           Expires 18 August 2022                 [Page 2]

Internet-Draft   BFD Directed Return Path for MPLS LSPs    February 2022


   associated with a particular BFD session.  The TLV will be allocated
   from the TLV and sub-TLV registry defined in [RFC8029].  As a special
   case, forward and reverse directions of the BFD session can form a
   bi-directional co-routed associated channel.

1.1.  Conventions used in this document

1.1.1.  Requirements Language

   The key words "MUST", "MUST NOT", "REQUIRED", "SHALL", "SHALL NOT",
   "SHOULD", "SHOULD NOT", "RECOMMENDED", "NOT RECOMMENDED", "MAY", and
   "OPTIONAL" in this document are to be interpreted as described in BCP
   14 [RFC2119] [RFC8174] when, and only when, they appear in all
   capitals, as shown here.

2.  Problem Statement

   When BFD is used to monitor explicitly routed unidirectional path,
   e.g., MPLS-TE LSP, BFD control packets in forward direction would be
   in-band using the mechanism defined in [RFC5884].  But the reverse
   direction of the BFD session would follow the shortest path route and
   that might lead to the problem in detecting failures on an explicit
   unidirectional path, as described below:

   *  detection by an ingress node of a failure on the reverse path may
      not be unambiguously interpreted as the failure of the path in the
      forward direction.

   To address this scenario, the egress BFD peer would be instructed to
   use a specific path for BFD control packets.

3.  Control of the Reverse BFD Path

   To bootstrap a BFD session over an MPLS LSP, LSP ping, defined in
   [RFC8029], MUST be used with BFD Discriminator TLV [RFC5884].  This
   document defines a new TLV, BFD Reverse Path TLV, that MAY contain
   none, one or more sub-TLVs that can be used to carry information
   about the reverse path for the BFD session that is specified by the
   value in BFD Discriminator TLV.

3.1.  BFD Reverse Path TLV

   The BFD Reverse Path TLV is an optional TLV within the LSP ping
   [RFC8029].  However, if used, the BFD Discriminator TLV MUST be
   included in an Echo Request message as well.  If the BFD
   Discriminator TLV is not present when the BFD Reverse Path TLV is
   included; then it MUST be treated as malformed Echo Request, as
   described in [RFC8029].



Mirsky, et al.           Expires 18 August 2022                 [Page 3]

Internet-Draft   BFD Directed Return Path for MPLS LSPs    February 2022


   The BFD Reverse Path TLV carries information about the path onto
   which the egress BFD peer of the BFD session referenced by the BFD
   Discriminator TLV MUST transmit BFD control packets.  The format of
   the BFD Reverse Path TLV is as presented in Figure 1.


     0                   1                   2                   3
     0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |   BFD Reverse Path TLV Type   |           Length              |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
    |                          Reverse Path                         |
    ~                                                               ~
    |                                                               |
    +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+

                       Figure 1: BFD Reverse Path TLV

   BFD Reverse Path TLV Type is two octets in length and has a value of
   TBD1 (to be assigned by IANA as requested in Section 6).

   Length field is two octets long and defines the length in octets of
   the Reverse Path field.

   Reverse Path field contains none, one or more sub-TLVs.  Any non-
   multicast Target FEC Stack sub-TLV (already defined, or to be defined
   in the future) for TLV Types 1, 16, and 21 of MPLS LSP Ping
   Parameters registry MAY be used in this field.  Multicast Target FEC
   Stack sub-TLVs, i.e., p2mp and mp2mp, SHOULD NOT be included in
   Reverse Path field.  If the egress LSR finds multicast Target Stack
   sub-TLV, it MUST send echo reply with the received Reverse Path TLV,
   BFD Discriminator TLV and set the Return Code to "Inappropriate
   Target FEC Stack sub-TLV present" Section 3.2.  None, one or more
   sub-TLVs MAY be included in the BFD Reverse Path TLV.  If no sub-TLVs
   are found in the BFD Reverse Path TLV, the egress BFD peer MUST
   revert to using the local policy-based decision as described in
   Section 7 [RFC5884], i.e., routed over IP network.

   If the egress LSR cannot find the path specified in the Reverse Path
   TLV it MUST send Echo Reply with the received BFD Discriminator TLV,
   Reverse Path TLV and set the Return Code to "Failed to establish the
   BFD session.  The specified reverse path was not found" Section 3.2.
   An implementation MAY provide configuration options to define action
   at the egress BFD peer.  For example, if the egress LSR cannot find
   the path specified in the Reverse Path TLV, it MAY establish the BFD
   session over an IP network, as defined in [RFC5884].





Mirsky, et al.           Expires 18 August 2022                 [Page 4]

Internet-Draft   BFD Directed Return Path for MPLS LSPs    February 2022


   The BFD Reverse Path TLV MAY be used in the bootstrapping of a BFD
   session process described in Section 6 [RFC5884].  A system that
   supports this specification MUST support using the BFD Reverse Path
   TLV after the BFD session has been established.  If a system that
   supports this specification receives an LSP Ping with the BFD
   Discriminator TLV and no BFD Reverse Path TLV even though the reverse
   path for the specified BFD session has been established according to
   the previously received BFD Reverse Path TLV, the egress LSR MUST
   transition to transmitting periodic BFD Control messages as defined
   in Section 7 [RFC5884].

3.2.  Return Codes

   This document defines the following Return Codes for MPLS LSP Echo
   Reply:

   *  "Inappropriate Target FEC Stack sub-TLV present", (TBD3).  When
      multicast Target FEC Stack sub-TLV found in the received Echo
      Request by the egress BFD peer, an Echo Reply with the return code
      set to "Inappropriate Target FEC Stack sub-TLV present" MUST be
      sent to the ingress BFD peer Section 3.1.

   *  "Failed to establish the BFD session.  The specified reverse path
      was not found", (TBD4).  When a specified reverse path is not
      available at the egress BFD peer, an Echo Reply with the return
      code set to "Failed to establish the BFD session.  The specified
      reverse path was not found" MUST be sent back to the ingress BFD
      peer Section 3.1.

4.  Use Case Scenario

   In the network presented in Figure 2 node A monitors two tunnels to
   node H: A-B-C-D-G-H and A-B-E-F-G-H.  To bootstrap a BFD session to
   monitor the first tunnel, node A MUST include a BFD Discriminator TLV
   with Discriminator value (e.g., foobar-1) and MAY include a BFD
   Reverse Path TLV that references H-G-D-C-B-A tunnel.  To bootstrap a
   BFD session to monitor the second tunnel, node A MUST include a BFD
   Discriminator TLV with a different Discriminator value (e.g., foobar-
   2) [RFC7726] and MAY include a BFD Reverse Path TLV that references
   H-G-F-E-B-A tunnel.


           C---------D
           |         |
   A-------B         G-----H
           |         |
           E---------F




Mirsky, et al.           Expires 18 August 2022                 [Page 5]

Internet-Draft   BFD Directed Return Path for MPLS LSPs    February 2022


                Figure 2: Use Case for BFD Reverse Path TLV

   If an operator needs node H to monitor a path to node A, e.g.
   H-G-D-C-B-A tunnel, then by looking up the list of known Reverse
   Paths it MAY find and use the existing BFD session.

5.  Operational Considerations

   When an explicit path is set either as Static or RSVP-TE LSP,
   corresponding sub-TLVs, defined in [RFC7110], MAY be used to identify
   the explicit reverse path for the BFD session.  If any of defined in
   [RFC7110] sub-TLVs used in BFD Reverse Path TLV, then the periodic
   verification of the control plane against the data plane, as
   recommended in Section 4 [RFC5884], MUST use the Return Path TLV, as
   per [RFC7110], with that sub-TLV.  By using the LSP Ping with Return
   Path TLV, an operator monitors whether at the egress BFD node the
   reverse LSP is mapped to the same FEC as the BFD session.  Selection
   and control of the rate of LSP Ping with Return Path TLV follows the
   recommendation of [RFC5884]: "The rate of generation of these LSP
   Ping Echo request messages SHOULD be significantly less than the rate
   of generation of the BFD Control packets.  An implementation MAY
   provide configuration options to control the rate of generation of
   the periodic LSP Ping Echo request messages."

   Suppose an operator planned network maintenance activity that
   possibly affects FEC used in the BFD Reverse Path TLV.  In that case,
   the operator MUST avoid the unnecessary disruption using the LSP Ping
   with a new FEC in the BFD Reverse Path TLV.  But in some scenarios,
   proactive measures cannot be taken.  Because the frequency of LSP
   Ping messages will be lower than the defect detection time provided
   by the BFD session.  As a result, a change in the reverse-path FEC
   will first be detected as the BFD session's failure.  In such a case,
   the ingress BFD node SHOULD immediately transmit the LSP Ping Echo
   request with Return Path TLV to verify whether the FEC is still
   valid.  If the failure was caused by the change in the FEC used for
   the reverse direction of the BFD session, the ingress BFD node SHOULD
   bootstrap a new BFD session using another FEC in BFD Reverse Path
   TLV.

6.  IANA Considerations

6.1.  BFD Reverse Path TLV

   The IANA is requested to assign a new value for BFD Reverse Path TLV
   from the "Multiprotocol Label Switching Architecture (MPLS) Label
   Switched Paths (LSPs) Ping Parameters - TLVs" registry, "TLVs and
   sub-TLVs" sub-registry.




Mirsky, et al.           Expires 18 August 2022                 [Page 6]

Internet-Draft   BFD Directed Return Path for MPLS LSPs    February 2022


            +=========+======================+===============+
            | Value   | Description          | Reference     |
            +=========+======================+===============+
            |  (TBD1) | BFD Reverse Path TLV | This document |
            +---------+----------------------+---------------+

                    Table 1: New BFD Reverse Type TLV

6.2.  Return Code

   The IANA is requested to assign a new Return Code value from the
   "Multi-Protocol Label Switching (MPLS) Label Switched Paths (LSPs)
   Ping Parameters" registry, "Return Codes" sub-registry, as follows
   using a Standards Action value.

         +=========+=============================+===============+
         | Value   | Description                 | Reference     |
         +=========+=============================+===============+
         |  (TBD3) | Inappropriate Target FEC    | This document |
         |         | Stack sub-TLV present.      |               |
         +---------+-----------------------------+---------------+
         |  (TBD4) | Failed to establish the BFD | This document |
         |         | session.  The specified     |               |
         |         | reverse path was not found. |               |
         +---------+-----------------------------+---------------+

                          Table 2: New Return Code

7.  Implementation Status

   - The organization responsible for the implementation: ZTE
   Corporation.

   - The implementation's name ROSng empowers traditional routers, e.g.,
   ZXCTN 6000.

   - A brief general description: A Return Path can be specified for a
   BFD session over RSVP tunnel or LSP.  The same can be specified for a
   backup RSVP tunnel/LSP.

   The implementation's level of maturity: production.

   - Coverage: RSVP LSP (no support for Static LSP)

   - Version compatibility: draft-ietf-mpls-bfd-directed-10.

   - Licensing: proprietary.




Mirsky, et al.           Expires 18 August 2022                 [Page 7]

Internet-Draft   BFD Directed Return Path for MPLS LSPs    February 2022


   - Implementation experience: simple once you support RFC 7110.

   - Contact information: Qian Xin qian.xin2@zte.com.cn

   - The date when information about this particular implementation was
   last updated: 12/16/2019

   Note to RFC Editor: This section MUST be removed before publication
   of the document.

8.  Security Considerations

   Security considerations discussed in [RFC5880], [RFC5884], [RFC7726],
   [RFC8029], and [RFC7110] apply to this document.

9.  Normative References

   [RFC2119]  Bradner, S., "Key words for use in RFCs to Indicate
              Requirement Levels", BCP 14, RFC 2119,
              DOI 10.17487/RFC2119, March 1997,
              <https://www.rfc-editor.org/info/rfc2119>.

   [RFC5880]  Katz, D. and D. Ward, "Bidirectional Forwarding Detection
              (BFD)", RFC 5880, DOI 10.17487/RFC5880, June 2010,
              <https://www.rfc-editor.org/info/rfc5880>.

   [RFC5881]  Katz, D. and D. Ward, "Bidirectional Forwarding Detection
              (BFD) for IPv4 and IPv6 (Single Hop)", RFC 5881,
              DOI 10.17487/RFC5881, June 2010,
              <https://www.rfc-editor.org/info/rfc5881>.

   [RFC5883]  Katz, D. and D. Ward, "Bidirectional Forwarding Detection
              (BFD) for Multihop Paths", RFC 5883, DOI 10.17487/RFC5883,
              June 2010, <https://www.rfc-editor.org/info/rfc5883>.

   [RFC5884]  Aggarwal, R., Kompella, K., Nadeau, T., and G. Swallow,
              "Bidirectional Forwarding Detection (BFD) for MPLS Label
              Switched Paths (LSPs)", RFC 5884, DOI 10.17487/RFC5884,
              June 2010, <https://www.rfc-editor.org/info/rfc5884>.

   [RFC7110]  Chen, M., Cao, W., Ning, S., Jounay, F., and S. Delord,
              "Return Path Specified Label Switched Path (LSP) Ping",
              RFC 7110, DOI 10.17487/RFC7110, January 2014,
              <https://www.rfc-editor.org/info/rfc7110>.







Mirsky, et al.           Expires 18 August 2022                 [Page 8]

Internet-Draft   BFD Directed Return Path for MPLS LSPs    February 2022


   [RFC7726]  Govindan, V., Rajaraman, K., Mirsky, G., Akiya, N., and S.
              Aldrin, "Clarifying Procedures for Establishing BFD
              Sessions for MPLS Label Switched Paths (LSPs)", RFC 7726,
              DOI 10.17487/RFC7726, January 2016,
              <https://www.rfc-editor.org/info/rfc7726>.

   [RFC8029]  Kompella, K., Swallow, G., Pignataro, C., Ed., Kumar, N.,
              Aldrin, S., and M. Chen, "Detecting Multiprotocol Label
              Switched (MPLS) Data-Plane Failures", RFC 8029,
              DOI 10.17487/RFC8029, March 2017,
              <https://www.rfc-editor.org/info/rfc8029>.

   [RFC8174]  Leiba, B., "Ambiguity of Uppercase vs Lowercase in RFC
              2119 Key Words", BCP 14, RFC 8174, DOI 10.17487/RFC8174,
              May 2017, <https://www.rfc-editor.org/info/rfc8174>.

Appendix A.  Acknowledgments

   The authors greatly appreciate a thorough review and the most helpful
   comments from Eric Gray and Carlos Pignataro.  The authors much
   appreciate the help of Qian Xin, who provided information about the
   implementation of this specification.

Authors' Addresses

   Greg Mirsky
   Ericsson

   Email: gregimirsky@gmail.com


   Jeff  Tantsura
   Juniper Networks

   Email: jefftant.ietf@gmail.com


   Ilya Varlashkin
   Google

   Email: Ilya@nobulus.com


   Mach(Guoyi) Chen
   Huawei

   Email: mach.chen@huawei.com




Mirsky, et al.           Expires 18 August 2022                 [Page 9]
